data = [
	{"name":"fields",
	"content":"<p>Tote bag pickled readymade Tumblr, four loko brunch Bushwick craft beer flannel tilde kogi pop-up Brooklyn Echo Park jean shorts. Pinterest twee heirloom Schlitz, dreamcatcher High Life organic sartorial artisan locavore listicle Echo Park keytar quinoa squid. YOLO synth Wes Anderson, bespoke retro post-ironic whatever polaroid gluten-free PBR&B kale chips American Apparel. 8-bit selfies mixtape, tote bag cray iPhone dreamcatcher polaroid typewriter Shoreditch hella vinyl pug McSweeney's Williamsburg. Meggings seitan four loko before they sold out post-ironic pop-up. Paleo food truck master cleanse chambray, Thundercats mlkshk direct trade cardigan actually. Polaroid four dollar toast Bushwick, stumptown Etsy health goth sriracha 8-bit chia deep v flannel lumbersexual occupy keffiyeh Tumblr.</p>",
	"linkedTo":["spaces","RREF"]
	},
	{
	"name":"spaces",
	"content":"Mumblecore kogi cronut sriracha selfies. Vinyl wayfarers actually bespoke mlkshk High Life. Forage photo booth leggings sustainable bespoke, mustache keffiyeh yr polaroid four loko Tumblr shabby chic chia four dollar toast. Echo Park four dollar toast farm-to-table bespoke, bitters meggings banjo. Bushwick hoodie meh occupy, gentrify roof party try-hard VHS taxidermy chillwave Tumblr fanny pack brunch. Pinterest pickled art party migas readymade Pitchfork. Helvetica letterpress mustache, Thundercats locavore scenester meggings next level keffiyeh Godard pickled tousled fashion axe lomo hoodie.</p>",
	"linkedTo":["fields","vectors","RREF"]
	},
	{"name":"Vectors",
	"content":"<p>Street art wolf ennui, authentic craft beer Brooklyn Vice salvia plaid. Pinterest single-origin coffee readymade bicycle rights chambray jean shorts, chillwave post-ironic narwhal drinking vinegar meditation iPhone. Retro cliche craft beer flexitarian. Twee sriracha meggings ethical roof party. Shoreditch beard vinyl typewriter Blue Bottle. Pug viral vinyl, put a bird on it sriracha shabby chic gluten-free church-key bespoke letterpress Thundercats YOLO authentic VHS. Helvetica food truck flexitarian, disrupt VHS kogi ethical pug drinking vinegar.<p>",
	"linkedTo":["Transforms","fields","Matrices","Eigenvectors"]
	},
	{"name":"RREF",
	"content":"<p>Tote bag Thundercats Shoreditch, pickled flannel sartorial authentic mustache raw denim leggings Helvetica lumbersexual vegan. Shoreditch Etsy PBR&B, direct trade chambray locavore retro banh mi brunch pickled blog mlkshk bespoke yr irony. Marfa next level 3 wolf moon kitsch. Authentic whatever cardigan slow-carb pickled seitan. Heirloom pug fingerstache banh mi, hoodie meditation mlkshk before they sold out. Cronut pork belly quinoa, authentic meggings slow-carb Blue Bottle irony before they sold out. Swag street art Etsy, put a bird on it direct trade raw denim roof party disrupt seitan brunch Brooklyn keffiyeh gentrify cornhole Truffaut.</p>",
	"linkedTo":["spaces","Transforms"]
	},
	{"name":"Transforms",
	"content":"<p>Carles quinoa gluten-free direct trade. Drinking vinegar American Apparel 90's wolf jean shorts. Twee tofu next level church-key sustainable, paleo fap cray 90's normcore. 90's health goth blog street art VHS farm-to-table. Tilde banjo keffiyeh bicycle rights. Meh Odd Future try-hard, chia Marfa lomo selfies tattooed fingerstache swag 3 wolf moon skateboard. Godard viral blog, gentrify ennui Etsy meggings mlkshk trust fund flannel Carles twee XOXO skateboard single-origin coffee.</p>",
	"linkedTo":["spaces"]
	},
	{"name":"cats",
	"content":"<p>Carles quinoa gluten-free direct trade. Drinking vinegar American Apparel 90's wolf jean shorts. Twee tofu next level church-key sustainable, paleo fap cray 90's normcore. 90's health goth blog street art VHS farm-to-table. Tilde banjo keffiyeh bicycle rights. Meh Odd Future try-hard, chia Marfa lomo selfies tattooed fingerstache swag 3 wolf moon skateboard. Godard viral blog, gentrify ennui Etsy meggings mlkshk trust fund flannel Carles twee XOXO skateboard single-origin coffee.</p>",
	"linkedTo":["spaces"]
	}
	{"name":"Eigenvectors",
	"content": "<p>an eigenvector is a vector** that satisfies the equation <MATH> <B>Ax = &lambda;x</MATH></p>",
	"linkedTo":["Vectors"]
	}
	{"name":"Matrices",
	"content":"<p> a thing. Will tell you more when I shake my watchers. </p>"
	"linkedTo":["Vectors"]
	}
]
